In [1]:
!pip install factor_analyzer

Requirement already satisfied: factor_analyzer in c:\users\admin\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (from factor_analyzer) (0.24.2)
Requirement already satisfied: numpy in c:\users\admin\anaconda3\lib\site-packages (from factor_analyzer) (1.19.5)
Requirement already satisfied: scikit-learn in c:\users\admin\anaconda3\lib\site-packages (from factor_analyzer) (0.21.2)
Requirement already satisfied: scipy in c:\users\admin\anaconda3\lib\site-packages (from factor_analyzer) (1.2.1)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\admin\anaconda3\lib\site-packages (from pandas->factor_analyzer) (2.8.0)
Requirement already satisfied: pytz>=2011k in c:\users\admin\anaconda3\lib\site-packages (from pandas->factor_analyzer) (2019.1)
Requirement already satisfied: joblib>=0.11 in c:\users\admin\anaconda3\lib\site-packages (from scikit-learn->factor_analyzer) (0.13.2)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas->factor_analyzer) (1.15.0)

In [1]:
import numpy as np
import pandas as pd
#from factor_analyzer import FactorAnalyzer
import matplotlib.pyplot as plt
from sklearn.cluster import KMeans
from sklearn import metrics
import random

In [2]:
data1 = pd.read_csv('movies data.csv')
data2 = pd.read_csv('ratings data.csv')

In [3]:
data1 = data1.drop('Unnamed: 0',axis = 1)
data2 = data2.drop(['Unnamed: 0','Timestamp'],axis = 1)

In [4]:
data1.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [5]:
data2.head()

   UserID  MovieID  Rating
0       1     1193       5
1       1      661       3
2       1      914       3
3       1     3408       4
4       1     2355       5

In [6]:
data = pd.merge(data2, data1 , how = "outer", on = "MovieID")

In [7]:
data.head()

   UserID  MovieID  Rating                                   Title Genres
0     1.0     1193     5.0  One Flew Over the Cuckoo's Nest (1975)  Drama
1     2.0     1193     5.0  One Flew Over the Cuckoo's Nest (1975)  Drama
2    12.0     1193     4.0  One Flew Over the Cuckoo's Nest (1975)  Drama
3    15.0     1193     4.0  One Flew Over the Cuckoo's Nest (1975)  Drama
4    17.0     1193     5.0  One Flew Over the Cuckoo's Nest (1975)  Drama

In [8]:
x = data.Genres
a = list()
for i in x:
    abc = i
    a.append(abc.split('|'))
a = pd.DataFrame(a)   
b = a[0].unique()
for i in b:
    data[i] = 0
data.head(2)

,UserID,MovieID,Rating,Title,Genres,Drama,Animation,Musical,Action,Comedy,...,Thriller,Crime,Western,Documentary,Mystery,Horror,Sci-Fi,Film-Noir,War,Fantasy
0,1.0,1193,5.0,One Flew Over the Cuckoo's Nest (1975),Drama,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2.0,1193,5.0,One Flew Over the Cuckoo's Nest (1975),Drama,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [9]:
for i in b:
    data.loc[data['Genres'].str.contains(i), i] = 1

In [10]:
data.head(2)

,UserID,MovieID,Rating,Title,Genres,Drama,Animation,Musical,Action,Comedy,...,Thriller,Crime,Western,Documentary,Mystery,Horror,Sci-Fi,Film-Noir,War,Fantasy
0,1.0,1193,5.0,One Flew Over the Cuckoo's Nest (1975),Drama,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2.0,1193,5.0,One Flew Over the Cuckoo's Nest (1975),Drama,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [11]:
# Now there is no use of genre 
# Since we have movie id so there is no need for movie names as well
data = data.drop(['Genres','Title'],axis =1)
data.head()

,UserID,MovieID,Rating,Drama,Animation,Musical,Action,Comedy,Adventure,Romance,...,Thriller,Crime,Western,Documentary,Mystery,Horror,Sci-Fi,Film-Noir,War,Fantasy
0,1.0,1193,5.0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2.0,1193,5.0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,12.0,1193,4.0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,15.0,1193,4.0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,17.0,1193,5.0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [12]:
data.columns

Index(['UserID', 'MovieID', 'Rating', 'Drama', 'Animation', 'Musical',
       'Action', 'Comedy', 'Adventure', 'Romance', 'Children's', 'Thriller',
       'Crime', 'Western', 'Documentary', 'Mystery', 'Horror', 'Sci-Fi',
       'Film-Noir', 'War', 'Fantasy'],
      dtype='object')

In [13]:
# Because of merging some null values are created
data.isnull().sum()

UserID         177
MovieID          0
Rating         177
Drama            0
Animation        0
Musical          0
Action           0
Comedy           0
Adventure        0
Romance          0
Children's       0
Thriller         0
Crime            0
Western          0
Documentary      0
Mystery          0
Horror           0
Sci-Fi           0
Film-Noir        0
War              0
Fantasy          0
dtype: int64

In [14]:
#WE simply drop the null values coz the are not treatable
data.dropna(inplace= True )

In [15]:
data.isnull().sum()

UserID         0
MovieID        0
Rating         0
Drama          0
Animation      0
Musical        0
Action         0
Comedy         0
Adventure      0
Romance        0
Children's     0
Thriller       0
Crime          0
Western        0
Documentary    0
Mystery        0
Horror         0
Sci-Fi         0
Film-Noir      0
War            0
Fantasy        0
dtype: int64

In [16]:
#By different methods we found that 8 cluster are better 
kmeanModel = KMeans(n_clusters=8)
kmeanModel.fit(data)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=8, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=None, tol=0.0001, verbose=0)

In [17]:
# Creating an extra column in data for storing the cluster values 
data['Cluster'] = kmeanModel.labels_
data['Cluster'].sample(n=10)

835025    5
345826    5
477435    6
311044    7
150110    2
757993    1
144096    0
550925    1
222870    6
496528    1
Name: Cluster, dtype: int32

In [20]:
data['Cluster'].value_counts()

2    139971
6    137505
1    126185
5    122046
7    121394
4    120556
3    118943
0    113609
Name: Cluster, dtype: int64

In [21]:
data.head()

,UserID,MovieID,Rating,Drama,Animation,Musical,Action,Comedy,Adventure,Romance,...,Crime,Western,Documentary,Mystery,Horror,Sci-Fi,Film-Noir,War,Fantasy,Cluster
0,1.0,1193,5.0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1,2.0,1193,5.0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
2,12.0,1193,4.0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
3,15.0,1193,4.0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
4,17.0,1193,5.0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [22]:
# When we merge the dataframe for a single movie multiple rows were created so a single movie is allotted
# to many clusters so here we allot a single cluster to a movie 
# the Cluster which occurs maximum number of times is alloted to the movie  
e = []
def fi(group):
    a = pd.DataFrame(group)
    b = pd.DataFrame(a['Cluster'].value_counts())
    d = a.index 
    c = [a['MovieID'][d[0]],int(b.idxmax())]
    e.append(c)

In [23]:
data.groupby("MovieID").apply(lambda x: fi(x))

Empty DataFrame
Columns: []
Index: []

In [24]:
e = pd.DataFrame(e)

In [25]:
e.head()

   0  1
0  1  6
1  1  6
2  2  6
3  3  3
4  4  7

In [26]:
# Here just the column names are swapped
e.rename(columns = {0:'MovieID',1:'Cluster'},inplace=True)
e.drop_duplicates(inplace=True)

In [27]:
e.head(10)

    MovieID  Cluster
0         1        6
2         2        6
3         3        3
4         4        7
5         5        7
6         6        6
7         7        1
8         8        3
9         9        1
10       10        6

In [28]:
data1 = pd.read_csv('movies data.csv')
new_data = pd.merge(e , data1 , how='outer', on='MovieID')

In [29]:
# These were the movies we deleted while merging the file  
new_data.isnull().sum()

MovieID         0
Cluster       177
Unnamed: 0      0
Title           0
Genres          0
dtype: int64

In [30]:
# We can delete the movies but We just labelled them randomly
new_data.fillna(random.randint(0,8),inplace=True)

In [31]:
new_data.isnull().sum()

MovieID       0
Cluster       0
Unnamed: 0    0
Title         0
Genres        0
dtype: int64

In [32]:
#This function select the cluster for a user according the the user choice
def select_c():
    global l
    print('Select The Movies Id you would like to watch:')
    l=[]
    for i in range(15):
        l.append(random.randint(0,3883))
    for i in l:
        print(new_data['MovieID'][i] , new_data['Title'][i],sep='--->')
    print('--------------------------------------------------------------------')
    l = int(input())
    l = new_data['Cluster'][new_data.MovieID == l]

In [33]:
# This is the main function which recommend you movies
def main():
    ans = False
    while not ans:
        select_c()
        print(new_data['Title'][new_data.Cluster == int(l)].sample(n=10))
        print('--------------------------------------------------------------------')
        print('Do you like these movies(y/n)')
        abc = input()
        while ((abc =='y') or (abc == 'Y')):          
            print(new_data['Title'][new_data.Cluster == int(l)].sample(n=10))
            print('--------------------------------------------------------------------')
            print('Want more!!!!(y/n)')
            abc = input()
            if ((abc =='N') or (abc == 'n')):
                ans =True

In [34]:
main()

Select The Movies Id you would like to watch:
1190--->Tie Me Up! Tie Me Down! (1990)
2623--->Trippin' (1999)
2995--->House on Haunted Hill, The (1999)
3903--->Urbania (2000)
2242--->Grandview, U.S.A. (1984)
2046--->Flight of the Navigator (1986)
1497--->Double Team (1997)
3465--->That's Life! (1986)
1017--->Swiss Family Robinson (1960)
505--->North (1994)
2317--->Alarmist, The (1997)
3353--->Closer You Get, The (2000)
3477--->Empire Records (1995)
2187--->Stage Fright (1950)
943--->Ghost and Mrs. Muir, The (1947)
--------------------------------------------------------------------
1497
1601                           Prophecy II, The (1998)
936                                     Curdled (1996)
179                                    Net, The (1995)
1023                        Glengarry Glen Ross (1992)
1657                             City of Angels (1998)
1334                          Meet Wally Sparks (1997)
1174                                 Unforgiven (1992)
175     Mighty Morphin Power Rangers: The Movie (1995)
1608                   Replacement Killers, The (1998)
645                                Bloodsport 2 (1995)
Name: Title, dtype: object
--------------------------------------------------------------------
Do you like these movies(y/n)
n
Select The Movies Id you would like to watch:
948--->Giant (1956)
2950--->Blue Lagoon, The (1980)
2201--->Paradine Case, The (1947)
3688--->Porky's (1981)
3875--->Devil Rides Out, The (1968)
982--->Picnic (1955)
2859--->Stop Making Sense (1984)
2245--->Working Girl (1988)
3587--->Inferno (1980)
2974--->Bats (1999)
2141--->American Tail, An (1986)
2446--->In Dreams (1999)
1856--->Kurt & Courtney (1998)
871--->Lover's Knot (1996)
1280--->Raise the Red Lantern (1991)
--------------------------------------------------------------------
871
105               Catwalk (1995)
629         Moll Flanders (1996)
858     Wizard of Oz, The (1939)
3818              Phoenix (1998)
458      I'll Do Anything (1994)
895        Penny Serenade (1941)
1098         Passion Fish (1992)
1022     Crying Game, The (1992)
3764    Charm's Incidents (1996)
3785               Inside (1996)
Name: Title, dtype: object
--------------------------------------------------------------------
Do you like these movies(y/n)
y
548     Welcome to the Dollhouse (1995)
83            Angels and Insects (1995)
3847            Naturally Native (1998)
842                      Vertigo (1958)
3745                    Hedd Wyn (1992)
3801            Ill Gotten Gains (1997)
1112              Withnail and I (1987)
3784         Somebody is Waiting (1996)
549                     Germinal (1993)
3880             Mad About Mambo (2000)
Name: Title, dtype: object
--------------------------------------------------------------------
Want more!!!!(y/n)
n